-- 插入学生数据
INSERT INTO student(name, gender, class) VALUES
('张三', '男', '计算机1班'),
('李四', '女', '计算机1班'),
('王五', '男', '计算机1班'),
('赵六', '女', '计算机2班'),
('孙七', '男', '计算机2班');

-- 插入课程数据
INSERT INTO course(course_name, teacher) VALUES
('高等数学', '王老师'),
('大学英语', '李老师'),
('数据结构', '张老师');

-- 插入成绩数据
INSERT INTO score(student_id, course_id, score_num) VALUES
(1, 1, 85), (1, 2, 78), (1, 3, 92),
(2, 1, 90), (2, 2, 88), (2, 3, 76),
(3, 1, 65), (3, 2, 72), (3, 3, 58),
(4, 1, 77), (4, 2, 95), (4, 3, 81),
(5, 1, 59), (5, 2, 63), (5, 3, 70);


SELECT * FROM student;
SELECT * FROM student WHERE class = '计算机1班' AND gender = '男';
SELECT * FROM score WHERE score_num > 80 ORDER BY score_num DESC;
#WHERE是筛选条件，ORDER BY是排序的意思， DESC是降序（默认升序）
#`*` 在 SQL 里叫**通配符**，意思：**所有字段（全部列）**

#TRUNCATE TABLE student;
#TRUNCATE TABLE course;
#TRUNCATE TABLE score;
#删除表


INSERT INTO student(name, gender, class) VALUES
('测试1号','男','计算机3班'),('测试2号','女','计算机3班'),
('测试3号','男','计算机3班'),('测试4号','女','计算机3班'),
('测试5号','男','计算机3班'),('测试6号','女','计算机3班'),
('测试7号','男','计算机3班'),('测试8号','女','计算机3班'),
('测试9号','男','计算机3班'),('测试10号','女','计算机3班'),
('测试11号','男','计算机3班'),('测试12号','女','计算机3班'),
('测试13号','男','计算机3班'),('测试14号','女','计算机3班'),
('测试15号','男','计算机3班'),('测试16号','女','计算机3班'),
('测试17号','男','计算机3班'),('测试18号','女','计算机3班'),
('测试19号','男','计算机3班'),('测试20号','女','计算机3班');
#VALUE后面跟着真正要存入的数据


SELECT * FROM student WHERE name = '测试10号';

